# CouldNotGenerateReferencesForFamilyInstance Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CouldNotGenerateReferencesForFamilyInstance Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Could not generate references for Family Instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CouldNotGenerateReferencesForFamilyInstance { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CouldNotGenerateReferencesForFamilyInstance As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CouldNotGenerateReferencesForFamilyInstance {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace